# TooFewPoints Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SiteImportFailures..::..TooFewPoints Property
BuiltInFailures..::..SiteImportFailures Class See Also
---
The toposolid must have at least three distinct points
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId TooFewPoints { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TooFewPoints As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ TooFewPoints {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SiteImportFailures Class
Autodesk.Revit.DB Namespace